# -*- coding:utf-8 -*-

week = {
    'Mon': 0,
    'Tue': 1,
    'Wed': 2,
    'Thu': 3,
    'Fri': 4,
    'Sat': 5,
    'Sun': 6,
}

start_time = {
    '08': 1,
    '09': 2,
    '10': 3,
    '11': 4,
    '12': 4,
    '13': 4,
    '14': 5,
    '15': 6,
    '16': 7,
    '17': 8,
    '18': 9,
    '19': 10,
    '20': 11,
    '21': 12,
    '22': 13,
    '23': 14
}

week_btn = {
    0: 'checkbox_single',
    1: 'checkbox_double',
    2: 'checkbox_all',
}

time_to_school = {
    '2018': 0,
    '2017': 1,
    '2016': 2,
    '2015': 3,
    '2014': 4,
}

degree = {
    '中学生': 0,
    '大学生': 1,
    '研究生': 2,
    '博士生': 3,
}